app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title 3"], ["summary", "3"], ["body", "3"], ["created_at", "2018-09-02 17:01:06.815682"], ["updated_at", "2018-09-02 17:01:06.815682"]]
---
	def create
		@post = Post.new(post_params)
		if @post.save

UPDATE "posts" SET "summary" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["summary", "second 1"], ["updated_at", "2018-09-02 17:16:44.615706"], ["id", 2]]
---
	def update
		if @post.update_attributes(post_params)